// 1) 'number' + 3 + 3 -> number33 (конкатенація)

// 2) null + 3 -> 3 (числове перетворення)

// 3) 5 && "qwerty" -> gwerty (&& повертає перший falsy або останній truthy операнд, оскільки перший 5 truthy, то повертається "gwerty")

// 4) +'40' + +'2' + "hillel"; -> 42hillel (конкатенація з рядком)

// 5) '10' - 5 === 6; -> false (оператор "-" числовий; '10' -> 10; 10-5 -> 5; 5===6 -> false)

// 6) true + false -> 1 (числовий '+' -> boolean у число: true -> 1, false -> 0; тому 1+0 -> 1)

// 7) '4px' - 3 -> NaN (числовий '-'; '4px' -> Number('4px')=Nan; Nan-3 -> Nan)

// 8) '4' - 3 -> 1 ('-'числовий; '4' -> 4; 4-3 -> 1)

// 9) '6' + 3 ** 0; -> 61 (степінь ** має пріоритет, тому 3**0 -> 1; '6'+1 -> 61 (конкатенація з рядком))

// 10) 12 / '6' -> 2 ('/'числовий; '6' -> 6; 12/6 -> 2)

// 11) '10' + (5 === 6); -> 10false ((5===6) -> false; '10'+false -> 10false (конкатенація))

// 12) null == '' -> false (null може бути лише undefined при ==)

// 13) 3 ** (9 / 3); -> 27 ((9/3) -> 3; 3**3 в періоді -> 27)

// 14) !!'false' == !!'true' -> true (!! подвійне логічне заперечення; не порожній рядок -> truthy; 'false' truthy -> !!'false' -> true; 'true'  truthy -> !!'true'  -> true; true == true -> true)

// 15) 0 || '0' && 1 -> 1 (пріоритет && вище за ||, тому '0' && 1 -> '0' thuthy, тому результат 1; 0 || 1 -> 0 falsy, тому результат 1)

// 16) (+null == false) < 1; -> false (+null -> 0; (0 == false) -> true (бо false -> 0 при ==); true < 1 -> 1 < 1 -> false (true ->  1 у числовому порівнянні))

// 17) false && true || true -> true (пріоритет && вище за ||, тому false && true -> false; false || true -> true)

// 18) false && (false || true); -> false ((false || true) -> true; false && true -> false)

//19) (+null == false) < 1 ** 5; -> false (1 ** 5 -> 1; +null -> 0; (0 == false) -> true; true < 1 -> 1 < 1 -> false)